Revit 2027 API
ConceptualSurfaceType.GetAllMassSubCategoryIds Method
 Get all the mass subcategory ids for which there are ConceptualSurfaceType's.
Namespace: Autodesk.Revit.DB.Analysis
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static IList<ElementId> GetAllMassSubCategoryIds()
Public Shared Function GetAllMassSubCategoryIds As IList(Of ElementId)
public:
static IList<ElementId^>^ GetAllMassSubCategoryIds()
static member GetAllMassSubCategoryIds : unit -> IList<ElementId>
Return Value
IList<ElementId>
 Returns an array of element id of mass subcategories for which there are ConceptualSurfaceType's.
See Also
Reference
ConceptualSurfaceType Class
Autodesk.Revit.DB.Analysis Namespace